
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если Поля.Найти("ЭлементПроцесса") = Неопределено Тогда
		Поля.Добавить("ЭлементПроцесса");
	КонецЕсли;
	Если Поля.Найти("Персона") = Неопределено Тогда
		Поля.Добавить("Персона");
	КонецЕсли;
	Если Поля.Найти("КлючевоеДействие") = Неопределено Тогда
		Поля.Добавить("КлючевоеДействие");
	КонецЕсли;
	Если Поля.Найти("Описание") = Неопределено Тогда
		Поля.Добавить("Описание");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Данные.ЭлементПроцесса = Перечисления.ЭлементыПроцесса.ПользовательскаяИстория Тогда
		Представление = "" + Данные.Персона + " будет " + Данные.КлючевоеДействие;
		
	ИначеЕсли Данные.ЭлементПроцесса = Перечисления.ЭлементыПроцесса.Условие Тогда
		ДанныеПерсоны = ?(ЗначениеЗаполнено(Данные.Персона), "" + Данные.Персона + " ", "");
		
		Представление = Строка(ДанныеПерсоны) + Данные.Описание;
		
	Иначе
		Представление = Данные.Описание;
		
	КонецЕсли;
КонецПроцедуры
