
Процедура ПередЗаписью(Отказ)
	Если ЭлементПроцесса = Перечисления.ЭлементыПроцесса.ПользовательскаяИстория Тогда
		Если Истина
			И ЭтоНовый()
			И Не ЗначениеЗаполнено(ПользовательскаяИстория)
			Тогда
			
			НовыйЭлемент = Справочники.ПользовательскиеИстории.СоздатьЭлемент();
			
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ДополнительныеСвойства.ДанныеПользовательскойИстории);
			
			НовыйЭлемент.Записать();
			
			ПользовательскаяИстория = НовыйЭлемент.Ссылка;
			
		КонецЕсли;
		
		Представление = "[" + Персона + "] " + КлючевоеДействие;

	ИначеЕсли ЭлементПроцесса = Перечисления.ЭлементыПроцесса.ВложенныйПроцесс Тогда
		Если ЭтоНовый() Тогда
			НовыйЭлемент = Справочники.Процессы.СоздатьЭлемент();
			
			НовыйЭлемент.ЭлементПроцесса = Перечисления.ЭлементыПроцесса.Старт;
			НовыйЭлемент.Представление = Представление;
			НовыйЭлемент.Владелец = Владелец;
			
			НовыйЭлемент.УстановитьНовыйКод();
			
			Попытка
				НовыйЭлемент.Записать();
			Исключение
				Отказ = Истина;
				
				Возврат;
			КонецПопытки;
			
			ВложенныйПроцесс = НовыйЭлемент.Ссылка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
