
Процедура ПередЗаписью(Отказ)
	Если Ложь
		Или ЭлементПроцесса = Перечисления.ЭлементыПроцесса.Старт
		Или ЭлементПроцесса = Перечисления.ЭлементыПроцесса.ВложенныйПроцесс
		Тогда
		
		Представление = Наименование;
		
	ИначеЕсли ЭлементПроцесса = Перечисления.ЭлементыПроцесса.ПользовательскаяИстория Тогда
		Если ДополнительныеСвойства.Свойство("ДанныеПользовательскойИстории") Тогда
			НовыйЭлемент = Справочники.ПользовательскиеИстории.СоздатьЭлемент();
			
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ДополнительныеСвойства.ДанныеПользовательскойИстории);
			
			НовыйЭлемент.Записать();
			
			ПользовательскаяИстория = НовыйЭлемент.Ссылка;
			
			Представление = "[" + ДополнительныеСвойства.ДанныеПользовательскойИстории.Персона + "] " + ДополнительныеСвойства.ДанныеПользовательскойИстории.КлючевоеДействие;
		КонецЕсли;
	ИначеЕсли ЭлементПроцесса = Перечисления.ЭлементыПроцесса.Условие Тогда
		Если ДополнительныеСвойства.Свойство("ДанныеУсловия") Тогда
			Представление = ДополнительныеСвойства.ДанныеУсловия.Персона;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
