
Функция ПолучитьШаблонФичи() Экспорт
	ТегНумерации = ПолучитьТегНумерации();
	
	Шаблон =	
	"# language: ru
	|
	|" + ТегНумерации + "#Номер
	|
	|Функциональность: #Заголовок
	|	Как #Персона
	|	Хочу #НеобходимаяФункциональность
	|	Чтобы #КлючевоеДействие
	|
	|Сценарий:
	|	Допустим
	|	Когда
	|	Тогда	";
	
	Возврат Шаблон;
КонецФункции

Процедура УбратьСКонцовПробелы(Текст) Экспорт
	Текст = СокрЛП(Текст);
КонецПроцедуры

Функция ПолучитьТегНумерации() Экспорт
	Возврат "@userstory_";
КонецФункции
