
&НаКлиенте
Процедура СкрытьРодителей(Команда)
	ПоказатьПредупреждение(, "Не реализовано.");
КонецПроцедуры


&НаКлиенте
Процедура СоздатьНовый(ЭлементПроцесса, Родитель) 
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ЭлементПроцесса", ЭлементПроцесса);
	ПараметрыЗаполнения.Вставить("Владелец", Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы[0].ПравоеЗначение);
	ПараметрыЗаполнения.Вставить("Родитель", Родитель);
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
	
	ОткрытьФорму("Справочник.Процессы.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Создать_Старт(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.Старт"), Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Создать_Завершение(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.Завершение"), Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Создать_ПользовательскаяИстория(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.ПользовательскаяИстория"), Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Создать_Условие(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.Условие"), Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Создать_ВариантУсловия(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.ВариантУсловия"), Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Создать_ВложенныйПроцесс(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.ВложенныйПроцесс"), Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Создать_Комментарий(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.Комментарий"), Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "УстановитьКурсорНаНовыйЭлементПроцесса" Тогда
		Элементы.Список.ТекущаяСтрока = Параметр;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПереместитьВверх(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	ТекСсылка = ТекущиеДанные.Ссылка;
					
	ПереместитьВверхНаСервере(ТекущиеДанные.Ссылка);
	
	Элементы.Список.Обновить();
	
	Элементы.Список.ТекущаяСтрока = ТекСсылка;
КонецПроцедуры

&НаСервере
Процедура ПереместитьВверхНаСервере(ПовышаемыйЭлемент)
	СтарыйКод = ПовышаемыйЭлемент.Код;
	
	ПонижаемыйЭлемент = ПолучитьЭлементПеремещения(СтарыйКод, ПовышаемыйЭлемент.Родитель, Истина);
	Если ПонижаемыйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НовыйКод = ПонижаемыйЭлемент.Код;
	
	НачатьТранзакцию();
	
	Если УдалосьЗаменитьКодЭлемента(ПовышаемыйЭлемент, НовыйКод) Тогда
		Если УдалосьЗаменитьКодЭлемента(ПонижаемыйЭлемент, СтарыйКод) Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			
		КонецЕсли;
		
	Иначе
		ОтменитьТранзакцию();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	ТекСсылка = ТекущиеДанные.Ссылка;
	
	ПереместитьВнизНаСервере(ТекущиеДанные.Ссылка);
	
	Элементы.Список.Обновить();
	
	Элементы.Список.ТекущаяСтрока = ТекСсылка;
КонецПроцедуры

&НаСервере
Процедура ПереместитьВнизНаСервере(ПонижаемыйЭлемент) 
	СтарыйКод = ПонижаемыйЭлемент.Код;
	
	ПовышаемыйЭлемент = ПолучитьЭлементПеремещения(СтарыйКод, ПонижаемыйЭлемент.Родитель, Ложь);
	Если ПовышаемыйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НовыйКод = ПовышаемыйЭлемент.Код;
	
	НачатьТранзакцию();
	
	Если УдалосьЗаменитьКодЭлемента(ПонижаемыйЭлемент, НовыйКод) Тогда
		Если УдалосьЗаменитьКодЭлемента(ПовышаемыйЭлемент, СтарыйКод) Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
			
		КонецЕсли;
		
	Иначе
		ОтменитьТранзакцию();
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьЭлементПеремещения(Код, Родитель, Вврерх)
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Процессы.Ссылка
	|ИЗ
	|	Справочник.Процессы КАК Процессы
	|ГДЕ
	|	Процессы.Код " + ?(Вврерх, "<", ">") + " &Код
	|	И Процессы.Родитель = &Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Процессы.Код " + ?(Вврерх, "УБЫВ", "") + "";
	
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция УдалосьЗаменитьКодЭлемента(ПеремещаемыйЭлемент, Код)
	Результат = Ложь;
	
	ПеремещаемыйОбъект = ПеремещаемыйЭлемент.ПолучитьОбъект();
	
	ПеремещаемыйОбъект.Код = Код;
	
	Попытка
	  ПеремещаемыйОбъект.Записать();
		
		Результат = Истина;
	Исключение
	
	КонецПопытки;

	Возврат Результат;
КонецФункции

