
&НаКлиенте
Процедура СкрытьРодителей(Команда)
	ПоказатьПредупреждение(, "Не реализовано.");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовый(ЭлементПроцесса) 
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ЭлементПроцесса", ЭлементПроцесса);
	ПараметрыЗаполнения.Вставить("Владелец", Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы[0].ПравоеЗначение);
	ПараметрыЗаполнения.Вставить("Родитель", Элементы.Список.ТекущаяСтрока);
	
	ПараметрыФормы = Новый Структура;
									 
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
	
	ОткрытьФорму("Справочник.Процессы.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Создать_Старт(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.Старт"));
КонецПроцедуры

&НаКлиенте
Процедура Создать_Завершение(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.Завершение"));
КонецПроцедуры

&НаКлиенте
Процедура Создать_ПользовательскаяИстория(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.ПользовательскаяИстория"));
КонецПроцедуры

&НаКлиенте
Процедура Создать_Условие(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.Условие"));
КонецПроцедуры

&НаКлиенте
Процедура Создать_ВариантУсловия(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.ВариантУсловия"));
КонецПроцедуры

&НаКлиенте
Процедура Создать_ВложенныйПроцесс(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.ВложенныйПроцесс"));
КонецПроцедуры

&НаКлиенте
Процедура Создать_Комментарий(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.Комментарий"));
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "УстановитьКурсорНаНовыйЭлементПроцесса" Тогда
		Элементы.Список.ТекущаяСтрока = Параметр;
	КонецЕсли;
КонецПроцедуры
